[
  {
    "id": 1,
    "timestamp": "2021-07-22T14:29:39.163Z",
    "focus": "Persevering, I think. I'm just tired, but I'm still here..",
    "tarot": "I did a three card reading with the theme/question of, \"tomorrow.\" \n\nI got: \n- 10 of Pentacles (legacy, inheritance, culmination)\n- Ace of swords (a card I've pulled once before this week. The meaning I looked up was \"cutting to the heart of the matter\")\n- The Wheel (I don't think I've ever pulled this card before. signifies major changes)\n\nFrom the Labyrynthos app explanation: \n- 10 of pent: \"Represents the culmination of life's journeys. There's a sense of fulfillment that usually results from hard work in all of life's facets.\"\n- ace of swords: victor, raw strength, sharp mind\n- The Wheel: change, cycles, the way things must be",
    "journal": "Way too much. I'm exhausted, and I'm so damn lonely right now. I feel rejected because my partner doesn't like sleeping with me or eating with me. It's hard. ",
    "gratitude": "Hecate, Loki, Hades, Persephone, and chances to try again",
    "moon_phase": "Waxing gibbous - almost full! ",
    "self_care": "I went to DBT group, and I actually ate several good meals. I think I got enough calories today, which is a first. ",
    "other": "I'm so torn up right now about Kent. I'm honestly miserable in this relationship, and leaving would be such a relief. My core values and needs aren't being met, like even a little bit. There's so little to hold onto right now, and that's really hard. ",
    "meta": null
  },
  {
    "id": 2,
    "timestamp": "2021-07-23T19:48:47.154Z",
    "focus": "Loki, and getting to know him again from the ground up",
    "tarot": "Recently I drew the Knight of Wands (fire, passion, forward motion) along with Temperance. \n\nTemperance is all about balance - having one foot in the flow, and one foot on the solid ground. The card represents planning for a stable, long term future, which I really want. \n\nAt the same time, the Knight represents the fierce energy to keep moving forward, along with ambition and creative drive (my own interpretation, but also based on the Biddy Tarot card description.) \n\nOn the less-positive side of things, the Knight of Wands can represent impulsivity, poor decision making, and being essentially a fool who rushes in. \n\nBoth these cards have showed up in multiple readings lately, and they're something to pay attention to. They speak of the balance I want to acheive. ",
    "journal": "Way too much. I'm exhausted and haven't slept well in weeks. I'm worried I'm going through some kind of manic or mixed episode. My brain feels like it's going to chew itself to death, with how fast its spinning. \n\nIt's exhausting and terrifying. I honestly don't know if I'm going crazy, or if my environment is just crazy making. ",
    "gratitude": "Kent, my partner, and the way he takes care of me. Food, shelter, and a friend (Nohemi) who messages me when the moon is full.  Erin, Josh and Bella. The fact that I can stand up and walk around lately. ",
    "moon_phase": "Almost full!!!!",
    "self_care": "I ate good meals with protein. Took meds on time, and went to bed before midnight! ",
    "other": "I feel like I'm going crazy and it feels like I'm being abused/gaslit, but also that doesn't seem true, at the same time. I don't know what to think anymore. ",
    "meta": null
  },
  {
    "id": 4,
    "timestamp": "2021-07-25T00:16:43.393Z",
    "focus": "trying again",
    "tarot": "n/a",
    "journal": "I finally got a few nights of sleep in a row, so I'm feeling mentally more stable than I have in awhile. Things feel more balanced and okay. I also got to sleep with Kent last night, so that was really nice! ",
    "gratitude": "Kent, tv shows, Nohemi, friends",
    "moon_phase": "Full!!!",
    "self_care": "It's the start of the day, but I plan on taking meds, eating well, and getting rest. As well as working on code, since that helps my mental and emotional health. ",
    "other": "",
    "meta": null
  },
  {
    "id": 6,
    "timestamp": "2021-07-25T00:47:28.489Z",
    "focus": "Connection. With myself, with Loki, and with Nohemi.",
    "tarot": "I did a three card Tarot draw online (result here: https://bryangalera.com/tarot.php?c=ROzmlJuiPwPyPutlzzzzp)\n\nAfter shuffling but before drawing, my brain came up with the prompt of \"tomorrow, today, today,\" as the meanings for the three cards, from left to right. \n\nI drew: \nTomorrow: The Star (balance, creativity, one foot on the ground and one foot in the flow.)\nToday: The Empress (\"Something is about to be created\")\nToday: 4 of Cups (Shows a person sitting under a tree with their arms crossed, refusing a cup held out to them by an invisible being. They also have three cups in front of them, but don't seem to choose any of the options.) \n\nIt's interesting bc the 4 of cups is often a \"refusal\" card, and seeing as someone being a stick-in-the-mud and refusing to join in the fun. But it could just as easily be a *discernment* card. \n\nReaching out and taking a cup from an unknown source (especially a random floating hand) isn't actually a great idea, and it strikes me that sometimes what we see as being \"jaded\" is actually, in reality, just being smart. \n\nThat being said, I think this card for me today is an invitation to look over the options in front of me with a more generous eye, and look for the good along with the bad before I make any hard and fast decisions. I can be too easy to reject things wholesale without appreciating them or trying first. (But I can also be too gullible, and end up drinking poisoned water without realizing it.) \n\nI'm really kind of traumatized from everything I went through this year, with MAC and AEMP, and I think it's made me closed off to new possibilities. And that's valid and real, but also a shame. So maybe it's a good day to try to look for what makes the world worth it, again.\n\nReversals and all cards were enabled",
    "journal": "Wondering what I should do for the full moon tonight. It's a good time for culmination spells, especially with the 10 of cups in my draw a few days ago. I have things I want to be freed from as well - generational trauma I still can't shake. \n\nI may do a spell for that tonight, as well as a small ceremony for Hecate. We shall see. ",
    "gratitude": "Food. Gluten free cupcakes. Magic, and the ability to try again. ",
    "moon_phase": "Full moon. Probably a good day to work some magic and/or realize some goals. ",
    "self_care": "",
    "other": "",
    "meta": null
  }
]