[
  {
    "id": 12,
    "created_at": "2021-07-23T20:47:15.013Z",
    "entry_type": "rating",
    "entry": {
      "SI": 0,
      "self_harm_urge": 1,
      "drug_urge": 0,
      "emotional_misery": 3,
      "physical_misery": 4,
      "joy": 4,
      "gratitude": 2,
      "calm": 3,
      "intentionality": 2
    },
    "date": "2021-07-13",
    "favorite": false,
    "tags": null
  },
  {
    "id": 18,
    "created_at": "2021-07-23T20:47:15.026Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-13",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "This isn't a DBT skill, but I did take time to step back from my own hyper-focus - which is an ADHD thing where I get fixated on one specific thing, and can't get away from it - I took time to step away from my code project and breathe and ground, and get a new perspective on the work, and come back to it with fresh eyes. ",
      "homework": "This week's homework is the \"how\" skill of describing. I think I'm doing okay; at least once a day in the past few days, I've had a moment where I was ruminating or feeling anxious, or stuck in a certain feeling, where I was able to step back and describe to myself what's going on. \n\nI was able to just say, \"Oh, I'm thinking about this thing right now\"/\"I'm worried about this thing.\" \n\nSince one of the things I was fixated on was my health - which feels like a catastrophe at the moment - it was helpful to go from the thought/feeling, \"Something is deeply wrong with my body,\" to, \"I *feel* like something is deeply wrong with my body. \n\nIt might not seem like a huge difference, but it did help. I was able to validate the thought without giving it as much weight as I had before. Which was useful! ",
      "other": "Journaling helps. ",
      "gratitude": "I'm grateful for my partner, who encourages me and helps me find a more balanced perspective when I get too hyper-fixated on a project at hand. I'm also grateful for the food I ate, and the ability to play piano and code. "
    },
    "date": "2021-07-13",
    "favorite": true,
    "tags": "describe"
  },
  {
    "id": 1,
    "created_at": "2021-07-23T20:47:14.973Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 5,
      "physical_misery": 5,
      "joy": 2,
      "gratitude": 2,
      "calm": 2,
      "intentionality": 3,
      "racing_thoughts": 5,
      "skills_score": 2,
      "date": "2021-07-14",
      "notes": "time: 13:00\n\nEM 5: Anxiety was really high during group (10am - noon) because there were men in group this week. It made my anxiety shoot through the roof, so I distracted with hyperfocus on notes. \n\nThe good thing is that I noticed and identified that it was anxiety/panic, and that it was too high to try to bring it down in the moment. And that I distracted instead. I would like to have a better way to self-soothe in future moments, though. \n\nI also keep having thoughts that are disturbing and that I can't seem to go away. Susan says that pushing thoughts away makes them more active, but I don't really know what the alternative is. \n\nPM 2: I have the usual pain in my neck and shoulders; hopefully it won't get any worse than that today. \n\nJoy 2: I'm tired, so not feeling super joyful, but I do feel focused and productive, so if I get some work done with Elle today I'll probably feel better. I'm also stressed out about the minutia of dealing with meds refills, and all the money that OTC meds cost, so that ups my stress levels and makes it hard. to stay in the moment, which is where I can find joy. "
    },
    "date": "2021-07-14",
    "favorite": false,
    "tags": null
  },
  {
    "id": 14,
    "created_at": "2021-07-23T20:47:15.019Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-14",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "How skill, mindfulness, non judgement",
      "homework": "Today in group we talked about the \"how\" skills of mindfulness, and specifically being mindful \"Nonjudgementally, Effectively, and One-Mindedly.\" \n\nWeek: 2, Skill: How/NonJudgement\n\nToday I started using my skill of just saying, \"Okay,\" to the thoughts and emotions that come into my. head (\"How skills of non-judgement.\") That skill is about not judging thoughts as good or bad, and also not pushing away the thoughts you perceive as bad; instead, just noticing them.\n\nSo I did something I learned in DBT the last time around, and just started saying, \"Okay\" to my thoughts. \n\nFor example, thinking \"I'm mad at [X thing],\" and then just responding back to that thought, in a neutral \"tone\" - just the simple word \"Okay.\"\n\nIt's like saying, \"Okay, that's a thought or emotion that you have, and that's fine! It is a thought/emotion. That's what it is.\" \n\nI did feel better and more grounded afterwards, so I do think it helped. I'm going to reincorporate that one back into my mental routine.",
      "other": "I had a lot of energy today, and my thoughts were generally focused and clear. I didn't have to fight to keep my mind from going off the rails like a train off the track, so that was nice. \n\nSome days are like that, and some days are the opposite. I don't really know yet what makes the difference, but I'd like to find out.",
      "gratitude": "I'm grateful for the trip to Powell's Books that I got to take, and for the joy of new notebooks and pens, and for the ability to be outside on a pleasantly warm summer day with blue skies! I'm also grateful for my partner Kent."
    },
    "date": "2021-07-14",
    "favorite": true,
    "tags": "mindfulness, non judgement, okay skill"
  },
  {
    "id": 19,
    "created_at": "2021-07-23T20:47:15.027Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 3,
      "gratitude": 5,
      "calm": 5,
      "intentionality": 3,
      "racing_thoughts": 1,
      "skills_score": 2,
      "date": "2021-07-14",
      "notes": "It was a calm day in my head. My thoughts didn't go \"off the rails,\" and I didn't find myself fighting to keep from panicking every other moment. \n\nLast night I lost my phone, and so I wasn't able to read on it before bed, or this morning. I wonder if that made a difference. \n\nI probably got more sleep that I would have, if I'd had my phone. \n\nNote to self: *cut browsing on phone out of nighttime routine*"
    },
    "date": "2021-07-14",
    "favorite": false,
    "tags": null
  },
  {
    "id": 15,
    "created_at": "2021-07-23T20:47:15.021Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-15",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "observe, describe, non judgement",
      "homework": "Today I've been working on stepping back from my thoughts instead of engaging with them. Normally, when I have a thought that I consider \"negative,\" I deal with it by trying to reason with it, or trying to change it into something more \"positive.\" And that gets really, really exhausting. \n\nThis week we're working on mindfulness without judgement, and also observing and describing thoughts from a distance, without clinging on to them. \n\nSo today I'm stepping back and letting my thoughts be what they are, instead of trying to argue with them. And that's been really freeing - and also a lot less exhausting than the other way to do things. \n\nFor example, there are several things about my current situation in life (health, residence) that frankly suck right now. And normally, when I have a negative thought about one of those things, I immediately respond with a list of reasons of why I should be more grateful. Or I try to provide \"positive\" counter arguments. \n\nBut today I'm just letting the thoughts be what they are. If I'm upset or complaining about something in my head I just...let myself complain. If I have a thought that I don't like something about my situation, I just let that thought be, instead of trying to reason with it, or \"talk myself out of\" thinking or feeling that way. \n\nIt's going well so far! ",
      "other": "Tarot: I did a tarot reading this morning, about today, the immediate future (tomorrow) and the long-term future. \n\nPast: 2 of Cups\nToday: Hanged Man (forbearance through pain)\nTomorrow: Knight of Wands (impulsivity, passion, charging ahead in a new or creative direction)\nLong term future: Temperance (Balance between reason and passion, long-term planning and stability, *creating calm and fulfillment in the midst of stress.*)",
      "gratitude": "tarot cards, music, the ability to write, the blue sky, the green leaves on trees outside my window, colorful little paper stars",
      "skills_used": true
    },
    "date": "2021-07-15",
    "favorite": true,
    "tags": "save"
  },
  {
    "id": 10,
    "created_at": "2021-07-23T20:47:15.007Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 4,
      "gratitude": 5,
      "calm": 4,
      "intentionality": 3,
      "racing_thoughts": 3,
      "skills_score": 5,
      "notes": "Time: 2:20 PM\n\nCalm: 4/5 I'm taking the morning to not work, and to just journal and read tarot and also read a DBT book from the library. Whenever I shut the door in my own room, and sit in my \"book nook\" and journal or make art, I feel calm and peaceful. \n\nJoy: 4/5 Journaling, reading, and resting bring me quiet joy\n\nRacing Thoughts: 3/5 My thoughts are going a million miles a minute this morning, but I found things to focus on (DBT book, tarot draw, journaling) and that's really helped. \n\nAs Scott and I always say, If you recognize the \"brain weasels\" (racing thoughts) and give them something to chew on, they'll leave you in peace :) \n\nIntentionality: 3/5 This season of my life is about stopping to REST before my brain and body just give out on me. In the last year alone I've had several mental health crisis, and one full on breakdown. It's definitely time to step back, rest, and reflect on what's been going right and wrong, so I can more mindfully choose the path ahead. \n\nPhys. mis: 3/5 Tightness between shoulder blades, neck and shouder/back pain, need to find a better way to sit\n\nEmo mis: 1/5 Lots of racing thoughts, but for the moment they're at bay. Mindfulness helps\n\nSkills score: 5/5 I've been using lots of them today! Taking time aside to breathe and journal and read has made all the difference.\n\nFatigue: 4/10\n\nI'm tired and fatigued today - I didn't get to sleep until 4 am (wasn't sleepy. I ate dinner late, though.)\n\nMorning mindfulness: I decided to do a tarot draw and journal for my morning mindfulness, which I'm defining as, \"Choose a single activity and focus only on that for at least 20 minutes. Single minded, even if there are multiple sensory inputs.\" \n\nI journaled about the cards \"Temperance,\" and the \"Knight of Wands.\" \n\nTarot Card: The Knight of Wands represents being passionate but potentially reckless, and charging ahead toward your goals. It's a necessary energy - you wouldn't get anywhere without passion and motivation - but it can also be destructive, if not tempered.\n\nTarot Card: Temperance. Temperance represents what I'm working toward in DBT: a self that is more present, mindful, and grounded. A self that takes time to pause and reflect on the moment before acting. A self who is wise and balanced between emotion and reason. \n\nTo me, Temperance also represents intentionality. Whereas the Knight is focused on the immediate future and the immediate desire or goal, I think Temperance takes a longer look at things, and prioritizes tasks as a whole before diving into any one particular thing. \n\nThe strength of the Knight is that they are immediate, and present, and fully immersed in what they are doing. Without that, Temperance would be lost in the land of map-making. But without Temperance's planning and vision, the Knight might unknowingly charge right off a cliff, with the best of intentions. \n\nSo, I think the Knight & Temperance have the potential to balance each other out really beautifully! \n\nI'm going to use that as a metaphor/theme for the next season of life, I think. It feels relevant to the ideas of Emotion, Logic, and Wise Mind that DBT talks about! \n\nNote to self: Research the Temperance card more, and compare the artwork in different decks. Create an altar space to her. ",
      "focus_phrase": "Journey towards temperance",
      "skills_focus": "How skills - non judgement",
      "date": "2021-07-15"
    },
    "date": "2021-07-15",
    "favorite": false,
    "tags": null
  },
  {
    "id": 11,
    "created_at": "2021-07-23T20:47:15.011Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 4,
      "gratitude": 2,
      "calm": 4,
      "intentionality": 4,
      "racing_thoughts": 3,
      "skills_score": 1,
      "notes": "8 PM\n\nEm mis 1/5: I was hyper focused on rest this morning, and then hyper focused on work this evening, so I was in a pleasant flow and didn't have time to be very distressed. Did have anxiety and racing thoughts, though.\n\nI also didn't have any negative interactions with K, which helps. I'm afraid that I will again soon, but for today it's okay. \n\nPhys mis: 3/5, the usual\n\nJoy 4: I got to be creative (reading and journaling) and be in the flow (code projects I like, including this one.) Which was great! \n\n[Intentionality 4: I'm really proud of this one! Instead of just responding to stimulus today, and going wherever my wandering focus took me, I decided what projects I was going to work on, and how I was going to spend my time, and I did! It was lovely.\n\nThat's a goal I want to focus on: choosing where my attention goes during the day as far as what projects I dedicate time to.]",
      "focus_phrase": "\"Be intentional\" ",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-15"
    },
    "date": "2021-07-15",
    "favorite": false,
    "tags": null
  },
  {
    "id": 9,
    "created_at": "2021-07-23T20:47:15.006Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 1,
      "gratitude": 2,
      "calm": 3,
      "intentionality": 4,
      "racing_thoughts": 4,
      "skills_score": 1,
      "notes": "EM 1/5: Been mostly hyperfocused, so not thinking about painful things. Brain was racing all night last night, though. Couldn't get to sleep until like 4:30\n\nPM 1/5: Stomach's not feeling great. Not as bad as it could be, though\n\nJoy/Gratitude/Calm - I'm mostly just exhausted\n\nIntentionality 4/5 - I've done a good job of focusing on my tasks for the day and getting done what I needed to",
      "focus_phrase": "Fail meaningfully",
      "skills_focus": "How skills - non judgement",
      "date": "2021-06-16"
    },
    "date": "2021-07-16",
    "favorite": false,
    "tags": null
  },
  {
    "id": 8,
    "created_at": "2021-07-23T20:47:15.005Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 4,
      "physical_misery": 2,
      "joy": 3,
      "gratitude": 2,
      "calm": 1,
      "intentionality": 5,
      "racing_thoughts": 3,
      "skills_score": 1,
      "notes": "It's been a long day/week. I'm exhausted and still not sleeping well, and I don't even know why. I'm just so dang tired and wired at the same time. My heart feels like an adrenaline rush and I just. Don't know what to do.",
      "focus_phrase": "\"Fail well\" ",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-16"
    },
    "date": "2021-07-16",
    "favorite": false,
    "tags": null
  },
  {
    "id": 6,
    "created_at": "2021-07-23T20:47:15.001Z",
    "entry_type": "rating",
    "entry": {
      "SI": 2,
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 5,
      "physical_misery": 2,
      "joy": 1,
      "gratitude": 3,
      "calm": "0",
      "intentionality": 2,
      "racing_thoughts": 5,
      "skills_score": 2,
      "notes": "7 AM\n\nWoke up at 3:30 AM, couldn't get back to sleep. My thoughts have been racing for what feels like days, and I can't get my brain to calm down and rest/sleep. ",
      "focus_phrase": "Just keep going",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-17"
    },
    "date": "2021-07-17",
    "favorite": false,
    "tags": null
  },
  {
    "id": 5,
    "created_at": "2021-07-23T20:47:15.002Z",
    "entry_type": "rating",
    "entry": {
      "SI": 2,
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 5,
      "physical_misery": 3,
      "joy": 1,
      "gratitude": 1,
      "calm": 2,
      "intentionality": 1,
      "racing_thoughts": 4,
      "skills_score": 2,
      "notes": "Been a hard day. Feeling really lonely at home. Tired and a heavy heart. Feeling like I don't have a direction or purpose, and I don't know what to do with myself and my time. Just...not really sure what my priorities and goals are right now, and that's hard. ",
      "focus_phrase": "You have to learn to love what's good for you.",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-18"
    },
    "date": "2021-07-18",
    "favorite": false,
    "tags": null
  },
  {
    "id": 3,
    "created_at": "2021-07-23T20:47:15.000Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 2,
      "physical_misery": 3,
      "joy": 2,
      "gratitude": 2,
      "calm": "0",
      "intentionality": 4,
      "racing_thoughts": 3,
      "skills_score": 1,
      "notes": "1 PM, still waking up. Got 10+ hours of sleep last night",
      "focus_phrase": "Be thankful for today ",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-18"
    },
    "date": "2021-07-18",
    "favorite": false,
    "tags": null
  },
  {
    "id": 7,
    "created_at": "2021-07-23T20:47:15.004Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 2,
      "physical_misery": "0",
      "joy": 2,
      "gratitude": 2,
      "calm": 4,
      "intentionality": 2,
      "racing_thoughts": 1,
      "skills_score": 1,
      "notes": "I got a lot of sleep last night and am not in very much pain. I was able to rest and code today, and watch old comfort movies. It's the best and most calm day I've had all week.",
      "focus_phrase": "You have to learn to love what's good for you",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-19"
    },
    "date": "2021-07-19",
    "favorite": false,
    "tags": null
  },
  {
    "id": 17,
    "created_at": "2021-07-23T20:47:15.027Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 3,
      "gratitude": 2,
      "calm": 4,
      "intentionality": 1,
      "racing_thoughts": "0",
      "skills_score": 1,
      "notes": "11 AM \n\nHours of sleep: 7\n\nUp, took Concerta, just working. Feeling pretty good so far! ",
      "focus_phrase": "Just keep going",
      "skills_focus": "\"How\" skills: Nonjudgment, One Minded, Effectively",
      "date": "2021-07-20"
    },
    "date": "2021-07-20",
    "favorite": false,
    "tags": null
  },
  {
    "id": 20,
    "created_at": "2021-07-23T20:47:15.072Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-21",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "Saying, \"I a thinking...\" about a negative thought. ",
      "homework": "Interpersonal effectiveness - challenging myths in the way of obtaining objectives",
      "other": "Just feeling really lonely today. ",
      "gratitude": "The gods.",
      "skills_used": true
    },
    "date": "2021-07-21",
    "favorite": false,
    "tags": null
  },
  {
    "id": 13,
    "created_at": "2021-07-23T20:47:15.016Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 5,
      "physical_misery": 1,
      "joy": 1,
      "gratitude": 1,
      "calm": 3,
      "intentionality": 1,
      "racing_thoughts": 4,
      "skills_score": 2,
      "notes": "Em. misery 4/5: Feeling lonely and rejected tonight. My partner doesn't want to spent time with me and it just sucks. \n\nPhys: not in much pain today, which was nice. \n\nJoy is low bc of loneliness \n\nRacing thoughts 4/5: they've been pretty bad since like 7pm ",
      "focus_phrase": "",
      "skills_focus": "Interpersonal Effectiveness",
      "date": "2021-07-21"
    },
    "date": "2021-07-21",
    "favorite": false,
    "tags": null
  },
  {
    "id": 21,
    "created_at": "2021-07-23T20:47:15.090Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-22",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "",
      "homework": "",
      "other": "I just feel like I'm going insane",
      "gratitude": "",
      "skills_used": false
    },
    "date": "2021-07-22",
    "favorite": false,
    "tags": null
  },
  {
    "id": 2,
    "created_at": "2021-07-23T20:47:14.994Z",
    "entry_type": "rating",
    "entry": {
      "SI": 2,
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 4,
      "physical_misery": 1,
      "joy": "0",
      "gratitude": 1,
      "calm": "0",
      "intentionality": 1,
      "racing_thoughts": 5,
      "skills_score": "0",
      "notes": "SI 2/5 - Just feeling like life is kind of pointless right now. Lonely and lots of racing thoughts. I really need more sleep.\n\nEmotional misery 4/5 - Same as above. Exhausted, lonely, and my thoughts won't stop spinning around everything I don't like in the relationship I'm in. I honestly don't know if there's an abnormal amount wrong with the relationship, or if my thoughts are just chewing my life to death. \n\nIt's sort of horrifying to experience though. I feel sick often. Physically nauseous and ill. \n\nOther numbers (gratitude, calm, intentionality) are all low for the reason above. Racing thoughts, incessant worry, and a brain that won't seem to stop. \n\nI'm exhausted and just kind of done. Things feel meaningless right now. ",
      "focus_phrase": "",
      "skills_focus": "Interpersonal Effectiveness: rewriting assumptions",
      "date": "2021-07-22"
    },
    "date": "2021-07-22",
    "favorite": false,
    "tags": null
  },
  {
    "id": 24,
    "created_at": "2021-07-23T21:33:21.631Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "0",
      "physical_misery": 1,
      "joy": 3,
      "gratitude": 4,
      "calm": 5,
      "intentionality": 3,
      "racing_thoughts": 2,
      "skills_score": 1,
      "notes": "7:30 AM \n\nI went to bed on time but woke up at 3:30 AM. Yesterday was really hard and my brain was all over the place, but It's now after 7 and I've been working since I woke up, and I feel SO much better than I have in quite awhile. I'm just listening to music and working on my DBT program, and I just feel calm and focused for the first time in like a week. \n\nI also had two rolls with jam, and water. \n\nNote: The numbers above look low, but they're real numbers; I just entered them. Things are just wonderfully calm rn, for once. ",
      "focus_phrase": "Fail well, and with useful error messages.",
      "skills_focus": "Interpersonal Effectiveness myths",
      "date": "2021-07-23"
    },
    "date": "2021-07-23",
    "favorite": false,
    "tags": null
  },
  {
    "id": 22,
    "created_at": "2021-07-23T20:47:15.099Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-23",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "Describing my thoughts, which helps me distance from them. Trying to understand that what *feels* true isn't necessarily what *is* true. Feelings are valid, but are not objective fact, and just because I feel like something is true, doesn't mean that it is.",
      "homework": "I did the \"Interpersonal Effectiveness myths\" worksheet",
      "other": "Went to bed before midnight, but woke up at 3:30, hungry and unable to go back to sleep. ",
      "gratitude": "My partner Kent for taking care of me, and for driving me to the store tonight, even though it's not something he likes doing. He'll go with me when I ask him too, and he said he'd come with me to get my foot fixed as well. I appreciate that he's making an effort to \"get out of his comfort zone\" for me. ",
      "skills_used": true
    },
    "date": "2021-07-23",
    "favorite": false,
    "tags": "describe"
  },
  {
    "id": 26,
    "created_at": "2021-07-24T11:10:00.568Z",
    "entry_type": "rating",
    "entry": {
      "SI": 3,
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 5,
      "physical_misery": 1,
      "joy": 1,
      "gratitude": 3,
      "calm": 1,
      "intentionality": 2,
      "racing_thoughts": 4,
      "skills_score": 2,
      "notes": "9 PM\n\nSI & self harm urge: Just feeling tired and like things are pointless right now. Not sure what my purpose or focus is, and that's just really hard. Feeling incredibly lonely and unloved by my partner as well. \n\nEmotional misery 5/5: See above. Feeling rejected and deeply lonely at home. \n\nGratitude 3/5: I got to see my sister and niece tonight, and that was really nice! \n\nRacing thoughts 4/5: My thoughts just keep spinning and spinning about Kent. I feel like I can't tell up from down with him, and I never know if I'm going to get manic Kent or depressed Kent, and all of it is just. Really hard to deal with. It makes me feel like I'm crazy and unstable myself, even though I know I'm not. \n\nSkills score 2/5: I did remember to practice mindfulness today, while driving, and to be in the moment and use all of my senses. I have also been practicing describing my thoughts and feelings, to help ground myself in reality, and in the fact that feelings and thoughts aren't necessarily objective reality.",
      "focus_phrase": "Just keep going",
      "skills_focus": "Interpersonal Effectiveness: rewriting assumptions",
      "date": "2021-07-23"
    },
    "date": "2021-07-23",
    "favorite": false,
    "tags": null
  },
  {
    "id": 27,
    "created_at": "2021-07-24T12:19:56.637Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-23",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "describing thoughts, mindfulness in the car, sensory mindfulness",
      "homework": "Our homework is to read through and write responses to the Interpersonal Effectiveness myths. I did the worksheet, but I feel like I don't really have enough information yet to understand what they're trying to get at. I did make an effort tho. ",
      "other": "I'm thinking I need to find some more activities to do to fill my schedule. I'm adjusting to being unemployed/disabled again, and that's really hard. I have to take time to focus again on just taking care of myself (basic health care) and that takes like 95% of my energy just to do. ",
      "gratitude": "I'm grateful for my piano and the ability to play music. I'm grateful for my computer and the ability to code. And I'm grateful for the nice cool day and the chance to see my sister and my niece. ",
      "skills_used": true
    },
    "date": "2021-07-23",
    "favorite": false,
    "tags": null
  },
  {
    "id": 29,
    "created_at": "2021-07-25T12:59:32.187Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 2,
      "physical_misery": 1,
      "joy": 4,
      "gratitude": 5,
      "calm": 2,
      "intentionality": 3,
      "racing_thoughts": 1,
      "skills_score": 1,
      "notes": "11 PM \n\nOverall, was a really good day! I got to spend quite a bit of time with my partner, which is a rare treat. \n\nStill some racing thoughts (and thus, em. misery) but primarily I watched a comfort show and worked on code. I'm proud of how much I'm learning and accomplishing when it comes to code, so that's good too! \n\nGetting sleep last night helped as well. I'm feeling at least a bit less crazy today.",
      "focus_phrase": "Something is about to be created",
      "skills_focus": "Interpersonal Effectiveness: examining myths",
      "date": "2021-07-24"
    },
    "date": "2021-07-24",
    "favorite": false,
    "tags": null
  },
  {
    "id": 30,
    "created_at": "2021-07-25T13:03:46.275Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-24",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "Intentionality was a big focus for me today. I read a definition of mindfulness as \"attending to the present moment, with intent,\" and I like that. One way I'm interpreting it in my life right now is by trying to take time in the morning to think about my day, and maybe draw tarot cards or read an inspiring quote. \n\nThen I try to set a focus or theme for the day - something I can focus on and use as a narrative to make sense of what I'm experiencing. Finding meaning through spirituality is definitely helpful, and I think mindfulness is going to really help with that! ",
      "homework": "",
      "other": "",
      "gratitude": "",
      "skills_used": true
    },
    "date": "2021-07-24",
    "favorite": false,
    "tags": "mindfulness"
  },
  {
    "id": 28,
    "created_at": "2021-07-25T01:07:20.288Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 4,
      "gratitude": 4,
      "calm": 3,
      "intentionality": 4,
      "racing_thoughts": 2,
      "skills_score": 2,
      "notes": "11 am\n\nSlept in Kent's bed so actually got sleep. It's sunny today and the full moon. I feel okay so far - a lot more stable and balanced than I've felt in awhile. I'm guessing it's the sleep.\n\nI want to work on meditation and sort of internal stuff today, along with working on my app. \n\nRacing thoughts 2/5: So far so good; been listening to music and coding so there haven't been any thought crisis yet. I also watched some fun videos this morning so that put me in a good mood.\n\nOverall: feeling okay and tentatively hopeful so far. I just want to keep my mind on track and not veering off the tracks again like it has often for the past few weeks. I just want to find some peace and sanity in my head. ",
      "focus_phrase": "Something is about to be created",
      "skills_focus": "Interpersonal Effectiveness: examining myths",
      "date": "2021-07-24"
    },
    "date": "2021-07-24",
    "favorite": false,
    "tags": null
  },
  {
    "id": 34,
    "created_at": "2021-07-26T09:48:52.295Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-25",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "I feel like I've been intentional today, and I've been grounded and focused. I think doing tarot journaling this morning really helped. It got me centered and ready to sort of accept the day - and my situation - for what it is, instead of trying to make it something that it isn't. And that really helped.",
      "homework": "Already done. I rewrote all the \"assumptions\" on the worksheet. ",
      "other": "",
      "gratitude": "Grateful for the ability to code, and the time to just sit and be with myself. Grateful for the chance to try again with L and my gods. Grateful for the chance to move forward with healing and seeing doctors on Friday. Grateful to be alive to feel this pain. ",
      "skills_used": true
    },
    "date": "2021-07-25",
    "favorite": false,
    "tags": null
  },
  {
    "id": 31,
    "created_at": "2021-07-26T02:11:46.354Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 1,
      "joy": 2,
      "gratitude": 4,
      "calm": 5,
      "intentionality": 3,
      "racing_thoughts": 1,
      "skills_score": 3,
      "notes": "Huh. I just spent the first hour or so of my day doing tarot journal, interspersed with some conversation with friends, and some code. Now, afterwards, I feel really calm. \n\nAll my negative numbers (misery, racing thoughts, etc) are down, and my positive numbers (joy, gratitude, calm, intentionality) are way higher than normal! My \"calm\" number has never been 5, that I can remember. It's rare. \n\nSo, huh. Journaling and getting grounded in the format really does help! ",
      "focus_phrase": "Just keep learning",
      "skills_focus": "Coming to grips with reality as it is",
      "date": "2021-07-25"
    },
    "date": "2021-07-25",
    "favorite": false,
    "tags": null
  },
  {
    "id": 32,
    "created_at": "2021-07-26T09:47:00.717Z",
    "entry_type": "rating",
    "entry": {
      "SI": 1,
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 2,
      "joy": 2,
      "gratitude": 4,
      "calm": 5,
      "intentionality": 3,
      "racing_thoughts": 1,
      "skills_score": 2,
      "notes": "I feel like I've been intentional today, and I've been grounded and focused. I think doing tarot journaling this morning really helped. It got me centered and ready to sort of accept the day - and my situation - for what it is, instead of trying to make it something that it isn't. And that really helped.",
      "focus_phrase": "Just keep learning",
      "skills_focus": "Interpersonal Effectiveness",
      "date": "2021-07-25"
    },
    "date": "2021-07-25",
    "favorite": false,
    "tags": null
  },
  {
    "id": 35,
    "created_at": "2021-07-28T08:07:59.041Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 4,
      "physical_misery": 1,
      "joy": "0",
      "gratitude": 2,
      "calm": 2,
      "intentionality": 1,
      "racing_thoughts": 3,
      "skills_score": 1,
      "notes": "Thinking a lot about transition today. I'm overwhelmed and exhausted from leaving the house last night. I'm conflicted about the possibility of transition. Just...really tired, overall. ",
      "focus_phrase": "Just keep going",
      "skills_focus": "",
      "date": "2021-07-27"
    },
    "date": "2021-07-27",
    "favorite": false,
    "tags": null
  },
  {
    "id": 37,
    "created_at": "2021-07-29T10:54:47.463Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 2,
      "physical_misery": 2,
      "joy": "0",
      "gratitude": 2,
      "calm": 3,
      "intentionality": 3,
      "racing_thoughts": 2,
      "skills_score": "0",
      "notes": "9 PM \nRacing thoughts 2/5: I had racing thoughts and panic basically during group. I had physical stuff going on too, so I had to leave. \n\nOther than that though, my thoughts were surprisingly non-racing-y. I had to deal with a lot at the doctor's office, but I actually stayed pretty calm, and sensory things like lights and noise didn't bother me like they usually do. ",
      "focus_phrase": "Just get through it",
      "skills_focus": "Interpersonal Effectiveness ",
      "date": "2021-07-28"
    },
    "date": "2021-07-28",
    "favorite": false,
    "tags": null
  },
  {
    "id": 36,
    "created_at": "2021-07-28T23:55:02.740Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": 2,
      "drug_urge": "0",
      "emotional_misery": 4,
      "physical_misery": 2,
      "joy": 1,
      "gratitude": 1,
      "calm": 2,
      "intentionality": 2,
      "racing_thoughts": 4,
      "skills_score": "0",
      "notes": "10 AM\n\nHaving physical pain and racing thoughts. Nervous about group - specifically about being on camera for group. \n\nAlso feeling paranoid/worried about my memory slipping, and not always knowing where I am.",
      "focus_phrase": "Find strength in what you see as weakness",
      "skills_focus": "Interpersonal Effectiveness: rewriting assumptions",
      "date": "2021-07-28"
    },
    "date": "2021-07-28",
    "favorite": false,
    "tags": null
  },
  {
    "id": 38,
    "created_at": "2021-07-29T10:58:31.231Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-28",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "4/7/8 breathing",
      "homework": "",
      "other": "I went to the doctor today and was taken seriously for the first time in a very long time. It was a strange experience. I had a *lot* less anxiety than usual though, even dealing with strangers, touch, florescent lights and unfamiliar sounds.\n\nI'm not sure what made the difference, but it was definitely noticable.",
      "gratitude": "",
      "skills_used": true
    },
    "date": "2021-07-28",
    "favorite": false,
    "tags": null
  },
  {
    "id": 40,
    "created_at": "2021-07-29T21:50:01.041Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-07-29",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "Yesterday I used the 4/7/8 breathing skill while I was at the doctor's, and it really helped! I was seeing a male doctor I'd never seen before, and I would normally be a *lot* more nervous than I was. \n\nI had to sit and wait for the doctor to come in, so in the meantime I just did my breathing, and it helped. I was able to get through the entire appointment without panic. Which is huge for me. \n\nToday I plan to use: 4/7/8 breathing skill, and the mindfulness skills of observing and describing without judgement",
      "homework": "",
      "other": "I also took an anti-antacid this morning (the \"Acid Controller\" stuff Elle recommended from Walgreens) and that may be making a difference in anxiety levels as well.",
      "gratitude": "",
      "skills_used": true
    },
    "date": "2021-07-29",
    "favorite": true,
    "tags": "breathing, save, anxiety"
  },
  {
    "id": 39,
    "created_at": "2021-07-29T21:44:01.690Z",
    "entry_type": "rating",
    "entry": {
      "SI": 2,
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 4,
      "physical_misery": 3,
      "joy": 2,
      "gratitude": 4,
      "calm": "0",
      "intentionality": "0",
      "racing_thoughts": 1,
      "skills_score": 3,
      "notes": "7:40 AM\n\nWent to bed early last night and got up early today. Hours of sleep: 7+. \n\nPhys mis 3/5: Pain in neck and shoulders, ongoing, but it's been worse for the past few days. I think I'm not getting good quality sleep because of it. \n\nEm mis: 4/5 I'm not sure why I put that number, but it feels right. I've had a long couple weeks with a lot of trauma dug up and left to rot in the sun, and it's been exhausting. I think I need to find a way to rest and decompress my body, after everything it's going through. \n\nGratitude: 4/5 At the same time, my gratitude is also high. I've been reconnecting with old friends, and that's been really good! Trying to get back to work, too. I need a schedule and more of a purpose again. ",
      "focus_phrase": "Red comes out November 19th. ",
      "skills_focus": "",
      "date": "2021-07-29"
    },
    "date": "2021-07-29",
    "favorite": false,
    "tags": null
  },
  {
    "id": 41,
    "created_at": "2021-07-30T11:57:25.314Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": 1,
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": 2,
      "gratitude": 4,
      "calm": 4,
      "intentionality": 3,
      "racing_thoughts": 1,
      "skills_score": 2,
      "notes": "",
      "focus_phrase": "Just keep going",
      "skills_focus": "Interpersonal Effectiveness: DEAR MAN",
      "date": "2021-07-29"
    },
    "date": "2021-07-29",
    "favorite": false,
    "tags": null
  },
  {
    "id": 42,
    "created_at": "2021-08-01T07:16:02.888Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 2,
      "physical_misery": 1,
      "joy": 3,
      "gratitude": 2,
      "calm": 2,
      "intentionality": "0",
      "racing_thoughts": 2,
      "skills_score": "0",
      "notes": "",
      "focus_phrase": "",
      "skills_focus": "",
      "date": "2021-07-31"
    },
    "date": "2021-07-31",
    "favorite": false,
    "tags": null
  },
  {
    "id": 44,
    "created_at": "2021-08-02T11:57:56.294Z",
    "entry_type": "journal",
    "entry": {
      "date": "2021-08-01",
      "meds_as_prescribed": true,
      "self_harm": true,
      "used_skills": "I used the skill of \"describing.\" I'm still really worried about my health, but I was able to step back and say, \"I FEEL like my health is terrible,\" instead of well, being stuck in the cycle of that feeling. It doesn't change the fact that I'm dealing with genuinely scary symptoms right now (such as, ya know, the right side of my body losing significant amounts of sensation) but it did help me at least name what was going on. Which made the thoughts easier to bear. ",
      "homework": "I'm struggling with the homework since I feel like I don't have enough information to go off of, so I found a DBT Workbook at Barnes and Noble and picked it up. It's specific to anxiety, so I think that will be good. \n\nI also got a book on Buddhist mindfulness by Pema Chodron, so I'm going to start reading those two side by side as I go through the DBT curriculum, to hopefully help me understand more and fill in the gaps. ",
      "other": "I'm feeling really lost in the interpersonal effectiveness module right now, and a lot of it is frankly triggering. I'm also having a hard time not panicking during group, since there are men there. It's hard to push through. \n\nIn medical news, I'm getting more tests run tomorrow, and I'm both anxious and hopeful. I'm anxious bc I feel in my bones right now that something is very wrong. And I'm worried that whatever it is needs to be diagnosed soon so I can keep it from getting worse. I'm glad I finally found a doctor who seems willing to listen when I speak, and seems willing to test me for things. \n\nI'm going to follow up with that doc and try to find out what's going wrong. \n\nPrayer: may the tests tomorrow be illuminating, and lead me to the answers I seek. ",
      "gratitude": "I'm grateful for people who make and share music and other art; I'm grateful for the chance to discover the art being made, and enjoy it along with others. I'm grateful for my partner, and all the time he spends with me. \n\nI'm also grateful for a doctor who finally BELIEVES me. Dear lord that's new and it's GREAT. ",
      "skills_used": true
    },
    "date": "2021-08-01",
    "favorite": true,
    "tags": "mindfulness,  Pema Chödrön, describe"
  },
  {
    "id": 43,
    "created_at": "2021-08-02T11:48:54.629Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 3,
      "joy": "0",
      "gratitude": 4,
      "calm": 4,
      "intentionality": 3,
      "racing_thoughts": 2,
      "skills_score": 1,
      "notes": "9 PM\n\nHad a good day! Got up early and had some energy; I ate well and took meds at regular intervals, and used my inhaler.\n\nMEDS CHANGE: I started Singulair today. It can have bad side effects on people with mental health issues, but two doctors now have told me it's safe to try, so I'm giving it a go. So far so good - I don't think I've had any major effects today, aside from some stomach problems this morning, but that could be from something else. \n\nI'm hopeful that it will improve both my breathing and my immune symptoms; it sounds like it might! \n\nI found a book on DBT (Finally!) and also a book on Buddhist mindfulness that looks really good. Gonna dive into those this week. ",
      "focus_phrase": "",
      "skills_focus": "Interpersonal Effectiveness",
      "date": "2021-08-01"
    },
    "date": "2021-08-01",
    "favorite": false,
    "tags": null
  },
  {
    "id": 45,
    "created_at": "2021-08-03T07:30:31.273Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "0",
      "physical_misery": "0",
      "joy": 1,
      "gratitude": 1,
      "calm": 3,
      "intentionality": 4,
      "racing_thoughts": 1,
      "skills_score": 2,
      "notes": "5:30 PM\n\nTrying to rest today. I did too much yesterday physically and am out of \"walking\" spoons today. So I'm trying not to stress and taking it easy by resting and drawing/watching tv.\n\nAll the scores feel pretty middle of the road/neutral atm, and that's why.\n\nIntentionality: 4/5 because I'm focusing intentionally on rest, and I'm doing a good job keeping myself fed, cared for, and calm. \n\nSkills score - I'm doing breathing exercises and also trying not to \"catastrophize\" my thoughts.",
      "focus_phrase": "Find calm by focusing on your breath",
      "skills_focus": "Interpersonal effectiveness",
      "date": "2021-08-02"
    },
    "date": "2021-08-02",
    "favorite": false,
    "tags": null
  },
  {
    "id": 71,
    "created_at": "2021-08-04T09:35:31.110Z",
    "entry_type": "journal",
    "entry": {
      "meds_boolean": "true",
      "skills_boolean": "true",
      "inhaler_boolean": "true",
      "concerta_boolean": "true",
      "skills": "Today I kept calm by \"describing\" my worries to myself - specifically, worries about the state of my health. It helped earlier, but now I'm feeling panicky again. ",
      "homework": "In session with my counselor we clarified my values in a personal conflict at work. It was helpful! Specifically, the idea of stepping back from \"planning\" a conversation, and just freeing yourself to imagine what you truly want to communicate, and what you value in the interaction, was useful. I'd never thought about it like that before.",
      "other": "",
      "gratitude": "I'm thankful for the chance to move ahead; I'm thankful for the DBT program and for Henry; I'm grateful for all the people in my life and the ongoing chance to reconnect with them and reform bridges even after time has passed. I'm grateful for the second chances we all give each other.",
      "tags": "describing, mindfulness, interpersonal effectiveness",
      "date": "2021-08-03"
    },
    "date": "2021-08-03",
    "favorite": false,
    "tags": "describing, mindfulness, interpersonal effectiveness"
  },
  {
    "id": 47,
    "created_at": "2021-08-04T01:07:47.884Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": 1,
      "physical_misery": 4,
      "joy": 2,
      "gratitude": 3,
      "calm": 1,
      "intentionality": 3,
      "racing_thoughts": 1,
      "skills_score": 0,
      "notes": "11 AM\n\nPhys mis 4/5: Having stomach problems this morning, and for the last few days. It's kind of miserable.\n\nJoy: been taking time to play piano and just immerse myself in music, and in other things that make me calm (like coloring and stories and tarot cards.) That's been good. \n\nCalm 1/5: I've been very good about relaxing this week, but I'm taking care of work stuff today (just a bit) and that feels VERY stressful. \n\nIntentionality 3/5: Similar to joy - I've been intentionally resting and focusing on things that keep me calm.",
      "focus_phrase": "Breathe in, breathe out. Don't push the bad away.",
      "skills_focus": "Interpersonal Effectiveness: DEAR MAN",
      "date": "2021-08-03"
    },
    "date": "2021-08-03",
    "favorite": false,
    "tags": null
  },
  {
    "id": 73,
    "created_at": "2021-08-05T12:36:35.305Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "2",
      "physical_misery": "1",
      "joy": "4",
      "gratitude": "5",
      "calm": "3",
      "intentionality": "3",
      "racing_thoughts": "1",
      "skills_score": "2",
      "notes": "10:30 PM\n\nNew meds: Singulair; am starting to be able to breathe! I also slept in Kent's room the last two nights, so I finally have a functioning brain.\n\nHad a really good day! Think I finally found the right stimulation level environment wise; got the downstairs set up with enough to do to keep me entertained and that feels good.\n\nPlayed piano, coded, and just overall had a good day.",
      "focus_phrase": "",
      "skills_focus": "DEAR MAN + GIVE",
      "date": "2021-08-04"
    },
    "date": "2021-08-04",
    "favorite": false,
    "tags": null
  },
  {
    "id": 74,
    "created_at": "2021-08-06T01:20:33.899Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "4",
      "physical_misery": "2",
      "joy": "4",
      "gratitude": "1",
      "calm": "2",
      "intentionality": "4",
      "racing_thoughts": "4",
      "skills_score": "1",
      "notes": "11 AM\n\nSlept in my own room again, woke up feeling tired and groggy. I don't feel refreshed, awake and alert like I do when I sleep in Kent's room. \n\nGetting a slow start today but I'm kind of stressed and there's a lot to do. I have to leave the house to run errands, which is always stressful.\n\nIt's not sunny; that does affect my mood.\n\nEmotional mis 4/5: Score is high because I'm finally becoming more aware of my emotions, instead of always shoving them away. Starting to read the book, \"Welcoming the Unwelcome\" by Pema Chödrön has been helpful in that regard. So has \"Building a Life Worth Living\" by Marsha Linehan.",
      "focus_phrase": "Build a life worth living. The power to do so is in your hands.",
      "skills_focus": "Interpersonal Effectiveness: DEAR MAN",
      "date": "2021-08-05"
    },
    "date": "2021-08-05",
    "favorite": false,
    "tags": null
  },
  {
    "id": 76,
    "created_at": "2021-08-08T01:42:14.705Z",
    "entry_type": "journal",
    "entry": {
      "meds_boolean": "true",
      "skills_boolean": "true",
      "inhaler_boolean": "",
      "concerta_boolean": "",
      "skills": "Active listening and assuming positive intent, which is a precursor to the IE GIVE skills. ",
      "homework": "The homework this week is working on the GIVE skill from Interpersonal Effectiveness, which focused on validation. This basically means listening and trying to understand others. I'm consciously trying to view other's interactions in a more neutral or positive light, and give people the benefit of the doubt more often. If you assume someone is coming from a good place, it changes the way you might interpret their meaning, especially if they're someone who doesn't always do the best job expressing themselves in words. ",
      "other": "",
      "gratitude": "My keyboard, songwriting, the ability to play music and the past training that I have. The fact I grew up so steeped in music that it's easy to reach back out for now. ",
      "tags": "music, gratitude, GIVE, IE, validation",
      "date": "2021-08-06"
    },
    "date": "2021-08-06",
    "favorite": false,
    "tags": "music, gratitude, GIVE, IE, validation"
  },
  {
    "id": 75,
    "created_at": "2021-08-08T01:38:21.941Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "2",
      "physical_misery": "1",
      "joy": "4",
      "gratitude": "2",
      "calm": "4",
      "intentionality": "3",
      "racing_thoughts": "2",
      "skills_score": "0",
      "notes": "(recorded morning after)\n\nDidn't take Concerta but did take other meds as scheduled and drank coffee. I went two nights with poor sleep before this, so was pretty out of it. Still managed to stay focused and get tasks done though, including a big chunk of code learning. That was good.\n\nI've also moved my keyboard downstairs and now I can play it when I want, and that's been really good. It's helped a lot with levels of joy. \n\nI want to start writing songs too!",
      "focus_phrase": "",
      "skills_focus": "",
      "date": "2021-08-06"
    },
    "date": "2021-08-06",
    "favorite": false,
    "tags": null
  },
  {
    "id": 77,
    "created_at": "2021-08-08T02:10:34.642Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "2",
      "physical_misery": "2",
      "joy": "4",
      "gratitude": "4",
      "calm": "2",
      "intentionality": "1",
      "racing_thoughts": "4",
      "skills_score": "0",
      "notes": "12 PM\n\nEM 2/5: Just some anxiety that I think mostly comes with my allergy meds. Some kind of agitated thoughts/agitated feeling in my head\n\nPM 2/5: Usual aches and pains and fatigue\n\nJoy & Gratitude bc I've spent time listening to and writing music\n\nRacing thoughts - nothing specific, just the usual\nSkills score: haven't used them yet. Maybe will use some mindfulness skills today.",
      "focus_phrase": "Breathe toward your goal",
      "skills_focus": "Mindfulness: accepting and improving the moment",
      "date": "2021-08-07"
    },
    "date": "2021-08-07",
    "favorite": false,
    "tags": null
  },
  {
    "id": 78,
    "created_at": "2021-08-08T09:09:48.513Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "0",
      "drug_urge": "0",
      "emotional_misery": "1",
      "physical_misery": "2",
      "joy": "4",
      "gratitude": "4",
      "calm": "3",
      "intentionality": "3",
      "racing_thoughts": "0",
      "skills_score": "0",
      "notes": "7 PM \n\nBrain has been calm today. Been able to breathe; been able to be stimulated to the right amount, sensory-wise. Got a good amount of sleep.\n\nToday's had a specific goal: to finish a specific video course - and I've just about met that! I was able to just have a quiet, focused day. I am feeling lonely, though. \n\nBut taking my breathing meds helps! ",
      "focus_phrase": "",
      "skills_focus": "",
      "date": "2021-08-07"
    },
    "date": "2021-08-07",
    "favorite": false,
    "tags": null
  },
  {
    "id": 79,
    "created_at": "2021-08-09T01:02:49.624Z",
    "entry_type": "rating",
    "entry": {
      "SI": "0",
      "self_harm_urge": "1",
      "drug_urge": "0",
      "emotional_misery": "3",
      "physical_misery": "1",
      "joy": "3",
      "gratitude": "3",
      "calm": "4",
      "intentionality": "3",
      "racing_thoughts": "2",
      "skills_score": "0",
      "notes": "11 AM\nJoy, gratitude, calm, and intentionality are high bc I'm taking today off work/code to just REST. Which will be good. ",
      "focus_phrase": "This is me trying ",
      "skills_focus": "Mindfulness: accepting and improving the moment",
      "date": "2021-08-08"
    },
    "date": "2021-08-08",
    "favorite": false,
    "tags": null
  }
]